cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GE6PZ.svd
        <register>
          <name>SYNC</name>
          <description>GPTM Synchronize</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>TIMER_SYNC_SYNCT0</name>
              <description>Synchronize GPTM 16/32-Bit Timer 0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_NONE</name>
                  <description>GPTM 16/32-Bit Timer 0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT1</name>
              <description>Synchronize GPTM 16/32-Bit Timer 1</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_NONE</name>
                  <description>GPTM 16/32-Bit Timer 1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT2</name>
              <description>Synchronize GPTM 16/32-Bit Timer 2</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_NONE</name>
                  <description>GPTM 16/32-Bit Timer 2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT3</name>
              <description>Synchronize GPTM 16/32-Bit Timer 3</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_NONE</name>
                  <description>GPTM 16/32-Bit Timer 3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT4</name>
              <description>Synchronize GPTM 16/32-Bit Timer 4</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_NONE</name>
                  <description>GPTM 16/32-Bit Timer 4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT5</name>
              <description>Synchronize GPTM 16/32-Bit Timer 5</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_NONE</name>
                  <description>GPTM 16/32-Bit Timer 5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TA</name>
                  <description>A timeout event for Timer A of GPTM 16/32-Bit Timer 5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TB</name>
                  <description>A timeout event for Timer B of GPTM 16/32-Bit Timer 5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 16/32-Bit Timer 5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT0</name>
              <description>Synchronize GPTM 32/64-Bit Timer 0</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT0_NONE</name>
                  <description>GPTM 32/64-Bit Timer 0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT0_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT0_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT0_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT1</name>
              <description>Synchronize GPTM 32/64-Bit Timer 1</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT1_NONE</name>
                  <description>GPTM 32/64-Bit Timer 1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT1_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT1_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT1_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT2</name>
              <description>Synchronize GPTM 32/64-Bit Timer 2</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT2_NONE</name>
                  <description>GPTM 32/64-Bit Timer 2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT2_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT2_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT2_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT3</name>
              <description>Synchronize GPTM 32/64-Bit Timer 3</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT3_NONE</name>
                  <description>GPTM 32/64-Bit Timer 3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT3_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT3_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT3_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT4</name>
              <description>Synchronize GPTM 32/64-Bit Timer 4</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT4_NONE</name>
                  <description>GPTM 32/64-Bit Timer 4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT4_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT4_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT4_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCWT5</name>
              <description>Synchronize GPTM 32/64-Bit Timer 5</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT5_NONE</name>
                  <description>GPTM 32/64-Bit Timer 5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT5_TA</name>
                  <description>A timeout event for Timer A of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT5_TB</name>
                  <description>A timeout event for Timer B of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCWT5_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM 32/64-Bit Timer 5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>TIMER_IMR_TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAMIM</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAEIM</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TAMIM</name>
              <description>GPTM Timer A Match Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBMIM</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBEIM</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBMIM</name>
              <description>GPTM Timer B Match Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_WUEIM</name>
              <description>GPTM Write Update Error Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>TIMER_RIS_TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAMRIS</name>
              <description>GPTM Timer A Capture Mode Match Raw Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAERIS</name>
              <description>GPTM Timer A Capture Mode Event Raw Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_RTCRIS</name>
              <description>GPTM RTC Raw Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TAMRIS</name>
              <description>GPTM Timer A Match Raw Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBMRIS</name>
              <description>GPTM Timer B Capture Mode Match Raw Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBERIS</name>
              <description>GPTM Timer B Capture Mode Event Raw Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBMRIS</name>
              <description>GPTM Timer B Match Raw Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_WUERIS</name>
              <description>GPTM Write Update Error Raw Interrupt</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>TIMER_MIS_TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAMMIS</name>
              <description>GPTM Timer A Capture Mode Match Masked Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAEMIS</name>
              <description>GPTM Timer A Capture Mode Event Masked Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_RTCMIS</name>
              <description>GPTM RTC Masked Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TAMMIS</name>
              <description>GPTM Timer A Match Masked Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBMMIS</name>
              <description>GPTM Timer B Capture Mode Match Masked Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBEMIS</name>
              <description>GPTM Timer B Capture Mode Event Masked Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBMMIS</name>
              <description>GPTM Timer B Match Masked Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_WUEMIS</name>
              <description>GPTM Write Update Error Masked Interrupt</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
